from 颜色 import *
import shutil

__all__ = [
    '终端宽度',
    '终端高度',
    '文本实际长度',
    '在中间对齐',
    '在中间打印',
    '无换行打印',
    '清屏',
]

终端宽度, 终端高度 = shutil.get_terminal_size()

def 文本实际长度(文本: str) -> int:
    '''
    计算文本实际长度
    不包含ANSI转义序列

    中文算2个字符(中文引号仍然算1个字符)
    (大部分等宽字体中文都是按照这个规则)
    '''
    去除颜色文本 = 去除所有颜色(文本)
    长度 = 0
    for 字符 in 去除颜色文本:
        if 字符 in '‘’“”':
            长度 += 1
            continue

        if ord(字符) > 127:
            长度 += 2
        else:
            长度 += 1
    return 长度

def 在中间对齐(文本: str) -> str:
    剩余数量 = (终端宽度 - 文本实际长度(文本))
    空格数量 = 剩余数量 // 2
    空格 = ' ' * 空格数量
    输出 = 空格 + 文本 + 空格
    if 剩余数量 % 2 != 0:
        输出 += ' '
    return 输出

def 在中间打印(文本: str, 颜色: str = 白色) -> None:
    用颜色打印(在中间对齐(文本), 颜色)

def 无换行打印(文本: str) -> None:
    print(文本, end='', flush=True)

def 清屏() -> None:
    无换行打印('\033[2J\033[;H\033[3J')