from 颜色 import *
from 基础 import *
from 版本 import 版本

def 欢迎() -> None:
    无换行打印('\n' * (终端高度 // 4)) # 顶部四分之一为空

    在中间打印('欢迎来到', 黄色)

    无换行打印('\n') # 空一行

    在中间打印('Minecraft', 绿色)
    在中间打印('Terminal Edition', 绿色)

    无换行打印('\n' * (终端高度 // 8)) # 八分之一为空

    在中间打印('作者: Yinhe', 绿色)
    在中间打印(f'版本: {版本}', 绿色)

    无换行打印('\n' * (终端高度 // 8)) # 八分之一为空

    在中间打印(f'警告: 请不要改变窗口大小, 否则游戏界面可能会乱码', 黄色)

    无换行打印('\n' * (终端高度 // 8)) # 八分之一为空

    import 询问
    询问.按人意键继续(提示信息=f'{蓝色}按任意键开始游戏{重置}...')

    清屏()